org-files/n8n.org
:PROPERTIES:
:ID:       96160698-e8dc-478b-bc7e-baa1b9916737
:END:
#+title: n8n
#+STARTUP: overview
#+date: 2024-12-05

### Docker-compose

#+begin_src yaml
  version: '3'

services:
  n8n:
    image: docker.n8n.io/n8nio/n8n
    container_name: n8n
    networks:
      - nginx-proxy-manager_default
    ports:
      - "5678:5678"
    environment:
      - VUE_APP_URL_BASE_API=https://n8n.zgz.sherblog.es
      - N8N_PROTOCOL=https
      - WEBHOOK_URL=https://n8n.zgz.sherblog.es
      - EXECUTIONS_DATA_PRUNE=true
      - EXECUTIONS_DATA_MAX_AGE=336
      - GENERIC_TIMEZONE=Europe/Madrid
    volumes:
      - ~/dockers/n8n/_data:/home/node/.n8n
      - ~/dockers/n8n/files:/home/node
    restart: always

networks:
  nginx-proxy-manager_default:
    external: true

volumes:
  n8n_data:
    external: true
#+end_src

La carpeta del sistema donde montamos los volúmenes debe tener permisos adecuados
#+begin_src bash
sudo chown -R 1000:1000 ~/dockers/n8n
sudo chmod -R 750 ~/dockers/n8n
#+end_src
Esto otorga acceso al usuario node dentro del contenedor (UID 1000).






Imprescindible cada vez que se modifique algún parámetro ejecutar
#+begin_src bash
  docker-compose down
  docker-compose up -d
#+end_src

### Conectar Mastodon
https://www.youtube.com/watch?v=Vb4TMKjr2_g
