public_html/n8n.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2026-03-20 vie 13:37 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>n8n</title>
<meta name="author" content="Sherlockes" />
<meta name="generator" content="Org Mode" />
<link rel='stylesheet' type='text/css' href='https://gongzhitaao.org/orgcss/org.css'/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">n8n</h1>
<p>
### Docker-compose
</p>

<div class="org-src-container">
<pre class="src src-yaml"><span style="color: #cae682;">services</span>:
  <span style="color: #cae682;">n8n</span>:
    <span style="color: #cae682;">image</span>: docker.n8n.io/n8nio/n8n
    <span style="color: #cae682;">container_name</span>: n8n
    <span style="color: #cae682;">networks</span>:
      - nginx-proxy-manager_default
    <span style="color: #cae682;">ports</span>:
      - <span style="color: #95e454;">"5678:5678"</span>
    <span style="color: #cae682;">environment</span>:
      - VUE_APP_URL_BASE_API=https://n8n.zgz.sherblog.es
      - N8N_PROTOCOL=https
      - WEBHOOK_URL=https://n8n.zgz.sherblog.es
      - EXECUTIONS_DATA_PRUNE=true
      - EXECUTIONS_DATA_MAX_AGE=336
      - GENERIC_TIMEZONE=Europe/Madrid
    <span style="color: #cae682;">volumes</span>:
      - ~/dockers/n8n/_data:/home/node/.n8n
      - ~/dockers/n8n/files:/home/node
    <span style="color: #cae682;">restart</span>: always

<span style="color: #cae682;">networks</span>:
  <span style="color: #cae682;">nginx-proxy-manager_default</span>:
    <span style="color: #cae682;">external</span>: <span style="color: #e5786d;">true</span>

<span style="color: #cae682;">volumes</span>:
  <span style="color: #cae682;">n8n_data</span>:
    <span style="color: #cae682;">external</span>: <span style="color: #e5786d;">true</span>
</pre>
</div>

<p>
La carpeta del sistema donde montamos los volúmenes debe tener permisos adecuados
</p>
<div class="org-src-container">
<pre class="src src-bash">sudo chown -R 1000:1000 ~/dockers/n8n
sudo chmod -R 750 ~/dockers/n8n
</pre>
</div>
<p>
Esto otorga acceso al usuario node dentro del contenedor (UID 1000).
</p>


<p>
Actualizar versión
docker pull docker.n8n.io/n8nio/n8n
</p>



<p>
Imprescindible cada vez que se modifique algún parámetro ejecutar
</p>
<div class="org-src-container">
<pre class="src src-bash">docker-compose down
docker-compose up -d
</pre>
</div>

<p>
### Conectar Mastodon
<a href="https://www.youtube.com/watch?v=Vb4TMKjr2_g">https://www.youtube.com/watch?v=Vb4TMKjr2_g</a>
</p>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2024-12-05</p>
<p class="author">Author: Sherlockes</p>
<p class="date">Created: 2026-03-20 vie 13:37</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
